#include "license.h"
#include "ui_license.h"

License::License(QWidget *parent) :
    QDialog(parent),
    ui(new Ui::License)
{
    ui->setupUi(this);
    setWindowFlags(windowFlags() | Qt::WindowMinMaxButtonsHint);
    ui->textBrowser->setText("ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ\n\n"

                             "Check Yourself\n"

                             "Статус программы: полная версия.\n\n"

                             "Пожалуйста, внимательно прочтите всё нижеследующее перед использованием этой программы. Если Вы с чем-то из "
                             "этого не согласны, Вам не следует пользоваться программой, и Вы ДОЛЖНЫ её немедленно удалить.\n\n"

                             "Лицензии/Авторские права:\n"
                             "Существует две версии этой программы: демо-версия и полная версия. Демо-версия (то есть условно-бесплатная) является "
                             "аналогом полной, но с ограниченным функционалом. Вам разрешается копировать условно-бесплатную версию (и ТОЛЬКО "
                             "её) и передавать другим людям на любой срок, пока она не модифицируется. Под модификацией понимается изменение, "
                             "добавление или удаление любых файлов этого пакета без письменного разрешения автора. Вам НЕ разрешается "
                             "комплектовать эту программу вместе с другой коммерческой программой или книгой. Пожалуйста, свяжитесь с нами, "
                             "если Вы хотите распространять программу с другой программой установки, изменёнными файлами и т.д. Полная версия "
                             "этой программы не является ни свободно распространяемой, ни предназначенной для общего пользования. Продажа, а "
                             "также модификация полной версии этой программы без письменного разрешения автора являются нарушением "
                             "международного законодательства об авторских правах!\n\n"

                             "Ответственность:\n"
                             "Были приложены все усилия, чтобы программа была настолько безошибочной, насколько это возможно. Однако программ "
                             "без ошибок не бывает. Программа предоставляется \"КАК ЕСТЬ\" (\"AS IS\"), в соответствии с общепринятым в "
                             "международной практике принципом. Таким образом, отвергается всякая ответственность за какие-либо виды ущерба.\n\n"

                             "Обратная связь:\n"
                             "По всем вопросам, касающимся данной программы, Вы можете можете писать на jackstone1601@gmail.com либо на "
                             "jackstone33@mail.ru. Подробную информацию о программе Вы найдете на нашем сайте: https://linguatime.ucoz.net.");
}

License::~License()
{
    delete ui;
}
